In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
arr = np.array([[1,2,np.nan],[np.nan, 3,4]])

In [5]:
arr

array([[ 1.,  2., nan],
       [nan,  3.,  4.]])

In [8]:
dframe1 = DataFrame(arr, index=['A','B'], columns=['One', 'Two', 'Three'])

In [9]:
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [10]:
dframe1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [12]:
dframe1.sum(axis=1)

A    3.0
B    7.0
dtype: float64

In [13]:
dframe1.min()

One      1.0
Two      2.0
Three    4.0
dtype: float64

In [14]:
dframe1.min(axis=1)

A    1.0
B    3.0
dtype: float64

In [16]:
dframe1.idxmin()

One      A
Two      A
Three    B
dtype: object

In [19]:
dframe1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [21]:
dframe1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [24]:
dframe1.cumsum(axis=0)

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  5.0    4.0

In [25]:
dframe1.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [28]:
import pandas.io.data as pdweb

ModuleNotFoundError: No module named 'pandas.io.data'

In [29]:
ser1 = Series(['w','w','x', 'y', 'z' ,'w' ,'w' ,'x' ,'x' ,'y' ,'a' ,'z' ])

In [30]:
ser1.unique()

array(['w', 'x', 'y', 'z', 'a'], dtype=object)

In [31]:
ser1.value_counts()

w    4
x    3
z    2
y    2
a    1
dtype: int64

In [35]:
ser1[0]

'w'